---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemId
source: html/a0c47cb7-40de-abb3-421f-d122281328cb.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemId Property

The optional MEP system element id where the iterations are restricted.

## Syntax (C#)
```csharp
public ElementId SystemId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null